# vim: set ft=ruby

tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "wix/brew"
brew "autoconf"
brew "coreutils"
brew "direnv"
brew "docker-compose"
brew "elixir-ls"
brew "exa"
brew "fzf"
brew "gcc"
brew "gopls"
brew "neovim"
brew "node"
brew "openssl@3"
brew "pinentry-mac"
brew "postgresql@14"
brew "protobuf"
brew "pyenv-virtualenv"
brew "python@3.9", link: false
brew "ripgrep"
brew "stow"
brew "stylua"
brew "wxwidgets"
brew "wix/brew/applesimutils"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "insomnia"
cask "kitty"
